[
  {
    "id": "pregunta_que_es_programar",
    "text": "¿Qué significa 'programar' un ordenador?",
    "options": [
      "Encender y apagar el ordenador",
      "Darle instrucciones paso a paso para que haga algo específico",
      "Cambiar el color de la pantalla",
      "Conectarlo a internet"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Programar es como enseñarle al ordenador cómo resolver un problema o realizar una tarea, escribiendo las instrucciones en un lenguaje que él pueda entender.",
    "difficulty": 1
  },
  {
    "id": "pregunta_que_es_un_programa",
    "text": "¿Qué es un 'programa' en el contexto de la programación?",
    "options": [
      "Un dibujo de un ordenador",
      "Un conjunto de instrucciones para que el ordenador realice una tarea",
      "Un tipo de música",
      "Un juego de mesa"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Un programa es precisamente eso: una serie de pasos detallados que le decimos a una máquina para que la ejecute y logre un objetivo.",
    "difficulty": 1
  },
  {
    "id": "pregunta_por_que_java",
    "text": "¿Por qué Java es un buen lenguaje para aprender programación?",
    "options": [
      "Porque es muy difícil",
      "Porque solo funciona en un ordenador",
      "Porque es fácil de leer y funciona en muchos tipos de ordenadores",
      "Porque es muy antiguo"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Java fue diseñado para ser claro y comprensible, y tiene la ventaja de que un programa escrito en Java puede ejecutarse en Windows, Mac, Linux y otros sistemas sin cambios.",
    "difficulty": 1
  },
  {
    "id": "pregunta_que_es_una_variable",
    "text": "En programación, ¿qué es una 'variable'?",
    "options": [
      "Un error en el código",
      "Una caja de almacenamiento en la memoria del ordenador que guarda un valor que puede cambiar",
      "Un programa completo",
      "Un tipo de teclado"
    ],
    "correctAnswerIndex": 1,
    "explanation": "Las variables son esenciales en programación porque nos permiten almacenar y manipular información mientras el programa se ejecuta, como la puntuación de un juego o el nombre de un usuario.",
    "difficulty": 2
  },
  {
    "id": "pregunta_tipo_dato_edad_java",
    "text": "Si necesitas guardar la edad de una persona (por ejemplo, 25) en una variable en Java, ¿cuál es el tipo de dato más adecuado?",
    "options": [
      "double",
      "boolean",
      "int",
      "String"
    ],
    "correctAnswerIndex": 2,
    "explanation": "El tipo int (de 'integer') se utiliza para números enteros, y la edad de una persona es típicamente un número entero sin decimales.",
    "difficulty": 2
  },
  {
    "id": "pregunta_declaracion_variable_entera_java",
    "text": "¿Cuál de las siguientes líneas declara correctamente una variable entera llamada puntuacion y le asigna un valor inicial de 100 en Java?",
    "options": [
      "puntuacion = 100;",
      "int puntuacion;",
      "int puntuacion = 100;",
      "Puntuacion int = 100;"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Esta línea declara una variable de tipo entero (int), la nombra puntuacion, y le asigna el valor 100 en el mismo momento.",
    "difficulty": 2
  },
  {
    "id": "pregunta_instruccion_hola_mundo_java",
    "text": "¿Cuál es la instrucción correcta en Java para mostrar el mensaje 'Hola Mundo' en la consola?",
    "options": [
      "print(\"Hola Mundo\");",
      "System.in.println(\"Hola Mundo\");",
      "System.out.println(\"Hola Mundo\");",
      "console.log(\"Hola Mundo\");"
    ],
    "correctAnswerIndex": 2,
    "explanation": "Esta es la sintaxis estándar en Java para imprimir texto en la consola de salida y añadir un salto de línea al final.",
    "difficulty": 3
  },
  {
    "id": "pregunta_estructura_principal_java_clase_main",
    "text": "En Java, ¿dentro de qué estructura principal se organiza el código y dónde se encuentra el método main?",
    "options": [
      "Un archivo de texto",
      "Una carpeta",
      "Una clase",
      "Una función"
    ],
    "correctAnswerIndex": 2,
    "explanation": "En Java, todo el código debe estar encapsulado dentro de una clase, incluyendo el método main que es el punto de inicio del programa.",
    "difficulty": 3
  },
  {
    "id": "pregunta_error_sintaxis_comun",
    "text": "¿Cuál es un error de sintaxis muy común en Java que impide que el código compile?",
    "options": [
      "Usar demasiados espacios",
      "Olvidar un punto y coma al final de una instrucción",
      "Escribir comentarios muy largos",
      "Nombrar una variable con mayúsculas"
    ],
    "correctAnswerIndex": 1,
    "explanation": "El punto y coma (;) es crucial en Java para indicar el final de una instrucción. Olvidarlo es una de las causas más frecuentes de errores de compilación.",
    "difficulty": 3
  }
]